app/Controllers/Dashboard.php

  private function getKelasList()
  {
    try {
      $user_id = $this->session->get('user_id');
      $tahun = $this->session->get('tahun');

      if (!$user_id || !$tahun) {
        return [];
      }

      return $this->guruKelasModel
        ->select('kelas.id, kelas.nama, kelas.jenjang, kelas.tingkat, semester.semester, semester.tahun')
        ->join('kelas', 'kelas.id = guru_kelas.kelas_id')
        ->join('semester', 'kelas.set = semester.id')
        ->where('guru_kelas.guru_id', $user_id)
        ->where('semester.tahun', $tahun)
        ->findAll();
---
SELECT `kelas`.`id`, `kelas`.`nama`, `kelas`.`jenjang`, `kelas`.`tingkat`, `semester`.`semester`, `semester`.`tahun`
FROM `guru_kelas`
JOIN `kelas` ON `kelas`.`id` = `guru_kelas`.`kelas_id`
JOIN `semester` ON `kelas`.`set` = `semester`.`id`
WHERE `guru_kelas`.`guru_id` = '8'
AND `semester`.`tahun` = '2025/2026'

  private function getEnhancedClassDataSafe($kelas_id)
  {
    $db = \Config\Database::connect();

    try {
      // Get basic class info
      $kelas = $db->table('kelas k')
        ->select('k.*, g.nama as wali_nama, s.semester, s.tahun')
        ->join('guru g', 'k.wali = g.id', 'left')
        ->join('semester s', 'k.set = s.id', 'left')
        ->where('k.id', $kelas_id)
        ->get()
        ->getRow();
---
SELECT `k`.*, `g`.`nama` as `wali_nama`, `s`.`semester`, `s`.`tahun`
FROM `kelas` `k`
LEFT JOIN `guru` `g` ON `k`.`wali` = `g`.`id`
LEFT JOIN `semester` `s` ON `k`.`set` = `s`.`id`
WHERE `k`.`id` = '11'

  private function getPartnerGuruSafe($kelas_id)
  {
    try {
      $current_user_id = $this->session->get('user_id');
      $db = \Config\Database::connect();

      $partners = $db->table('guru_kelas gk')
        ->select('g.nama')
        ->join('guru g', 'gk.guru_id = g.id')
        ->where('gk.kelas_id', $kelas_id)
        ->where('gk.guru_id !=', $current_user_id)
        ->get()
        ->getResultArray();
---
SELECT `g`.`nama`
FROM `guru_kelas` `gk`
JOIN `guru` `g` ON `gk`.`guru_id` = `g`.`id`
WHERE `gk`.`kelas_id` = '11'
AND `gk`.`guru_id` != '8'

  private function getSantriGrowthSafe($kelas_id)
  {
    try {
      $thisMonth = date('Y-m-01');
      $db = \Config\Database::connect();

      // Cek apakah ada kolom created_at
      $fields = $db->getFieldNames('ruang_kelas');

      if (in_array('created_at', $fields)) {
        // Pakai created_at jika ada
        $growth = $db->table('ruang_kelas rk')
          ->where('rk.kelas_id', $kelas_id)
          ->where('rk.created_at >=', $thisMonth)
          ->where('rk.created_at IS NOT NULL')
          ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `ruang_kelas` `rk`
WHERE `rk`.`kelas_id` = '11'
AND `rk`.`created_at` >= '2026-01-01'
AND `rk`.`created_at` IS NOT NULL

  private function getModulAjarCountSafe($kelas_id)
  {
    try {
      $semester = $this->session->get('id_set');

      return $this->modulAjarModel
        ->where('kelas_id', $kelas_id)
        ->where('semester', $semester)
        ->where('deleted', 0)
        ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `modul_ajar`
WHERE `kelas_id` = '11'
AND `semester` = '6'
AND `deleted` = 0

  private function calculateProgressRateSafe($kelas_id)
  {
    try {
      $totalSantri = $this->ruangKelasModel->where('kelas_id', $kelas_id)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `ruang_kelas`
WHERE `kelas_id` = '11'

  private function getRecentActivitiesSafe($kelas_id)
  {
    try {
      $activities = [];
      $db = \Config\Database::connect();

      // Try modul ajar dengan created_at atau fallback
      try {
        $fields = $db->getFieldNames('modul_ajar');

        if (in_array('created_at', $fields)) {
          $moduls = $this->modulAjarModel
            ->select('created_at, topik_pembelajaran')
            ->where('kelas_id', $kelas_id)
            ->where('deleted', 0)
            ->where('created_at IS NOT NULL')
            ->orderBy('created_at', 'DESC')
            ->limit(2)
            ->find();
---
SELECT `created_at`, `topik_pembelajaran`
FROM `modul_ajar`
WHERE `kelas_id` = '11'
AND `deleted` = 0
AND `created_at` IS NOT NULL
ORDER BY `created_at` DESC
 LIMIT 2