app/Controllers/Kelas.php

  public function get_tahun_list()
  {
    $data = $this->semesterModel
      ->select('tahun')
      ->distinct()
      ->where('deleted', 0)
      ->orderBy('tahun', 'DESC')
      ->findAll();
---
SELECT DISTINCT `tahun`
FROM `semester`
WHERE `deleted` = 0
ORDER BY `tahun` DESC

  public function ambil_data_kelas()
  {
    $request = \Config\Services::request();

    // Ambil filter dari POST
    $filterTahun = $request->getPost('tahun');
    $filterJenjang = $request->getPost('jenjang');

    // Builder query awal
    $builder = $this->kelasModel
      ->getKelasWithSemester()
      ->where('kelas.deleted', 0);
---
SELECT `kelas`.*, `kelas`.`tingkat` AS `kelas_tingkat`, `kelas`.`id` AS `kelas_id`
FROM `kelas`
WHERE `kelas`.`deleted` = 0