app/Controllers/LaporanBulanan.php

  public function index()
  {
    $kelas_id = session()->get('kelas_id');
    $tahun = session()->get('tahun');
    $semester = session()->get('semester');
    $guru_id = session()->get('user_id');

    $laporanList = $this->laporanModel->getLaporanByKelas($kelas_id, $tahun, $semester);
    $kelas = $this->kelasModel->find($kelas_id);
---
SELECT *
FROM `kelas`
WHERE `kelas`.`id` = '10'