app/Controllers/Login.php

SELECT COUNT(*) AS `numrows`
FROM `login_attempts`
WHERE `ip_address` = '127.0.0.1'
AND `attempted_at` >= '2026-01-06 15:24:00'
SELECT *
FROM `semester`
WHERE `tahun` = '2025/2026'
AND `semester` = 'genap'
 LIMIT 1
---
  public function auth()
  {
    $session = session();
    $model = new UserModel();
    $semester_model = new SemesterModel();

    $username = $this->request->getPost('username');
    $password = $this->request->getPost('password');
    $semester_post = $this->request->getPost('semester');
    $tahun_post = $this->request->getPost('tahun');
    $rememberMe = $this->request->getPost('remember_me');

    $ip = $this->request->getIPAddress();
    $maxAttempts = 5;
    $lockoutSeconds = 600;

    $loginAttemptModel = new \App\Models\LoginAttemptModel();

    $attempts = $loginAttemptModel
      ->where('ip_address', $ip)
      ->where('attempted_at >=', date('Y-m-d H:i:s', time() - $lockoutSeconds))
      ->countAllResults();

    if ($attempts >= $maxAttempts) {
      return redirect()->back()->with('message', 'Terlalu banyak percobaan login. Silakan coba lagi dalam 10 menit.');
    }

    $semester = $semester_model->where('tahun', $tahun_post)->where('semester', $semester_post)->first();

DELETE FROM `login_attempts`
WHERE `ip_address` = '127.0.0.1'
---
    $user = $model->where('username', $username)->first();

    if ($user && password_verify($password, $user['password'])) {
      $loginAttemptModel
        ->where('ip_address', $ip)
        ->delete();

INSERT INTO `login_attempts` (`ip_address`, `attempted_at`) VALUES ('103.189.201.73', '2026-01-06 13:43:32')
---

      return redirect()->to('/dashboard');
    } else {
      $loginAttemptModel->insert([
        'ip_address' => $ip,
        'attempted_at' => date('Y-m-d H:i:s')
      ]);

SELECT `semester`.`id` as `semester_id`, `semester`, `semester`.`tahun`, `kelas`.`tahun`, `kelas`.`id`, `kelas`.`nama`, `kelas`.`jenjang`, `kelas`.`tingkat`
FROM `guru_kelas`
JOIN `kelas` ON `kelas`.`id` = `guru_kelas`.`kelas_id`
JOIN `semester` ON `kelas`.`tahun` = `semester`.`tahun` AND `kelas`.`jenjang` = `semester`.`tingkat`
WHERE `guru_kelas`.`guru_id` = '1'
AND `semester`.`semester` = 'genap'
AND `semester`.`tahun` = '2025/2026'
ORDER BY `kelas`.`id` DESC
---
  protected function setUserSession($user, $semester_post, $tahun_post, $semester_data, $tahun_data, $id_set_data)
  {
    $session = session();
    $session->set([
      'user_id' => $user['id'],
      'username' => $user['username'],
      'nama' => $user['nama'],
      'logged_in' => true
    ]);

    $userId = $user['id'];
    $roles = (new \App\Models\UserRoleModel())->getUserRoles($userId);
    session()->set([
      'roles' => array_column($roles, 'type'),
    ]);

    $kelasList = $this->GuruKelasModel
      ->select('semester.id as semester_id, semester, semester.tahun, kelas.tahun, kelas.id, kelas.nama, kelas.jenjang, kelas.tingkat')
      ->join('kelas', 'kelas.id = guru_kelas.kelas_id')
      ->join(
        'semester',
        'kelas.tahun = semester.tahun AND kelas.jenjang = semester.tingkat'
      )
      ->where('guru_kelas.guru_id', $user['id'])
      ->where('semester.semester', $semester_post)
      ->where('semester.tahun', $tahun_post)
      ->orderBy('kelas.id', 'DESC')
      ->findAll();