app/Controllers/ModulAjar.php

  public function index()
  {
    // $kurikulum_cinta_model = new KurikulumCintaModel();
    $kurikulum_cinta = $this->kurikulumCintaModel->where('deleted', 0)->findAll(); // Ambil semua kategori
---
SELECT *
FROM `kurikulum_cinta`
WHERE `deleted` = 0

  public function ambil_data_modulajar()
  {
    $data = $this->modulAjarModel
      ->select('modul_ajar.*, desain_pembelajaran.modulajar_id_dp as modulajar_id_dp, pedagogik_model,
      pedagogik_strategi, pedagogik_metode, kemitraan, ruang_fisik, ruang_virtual, pemanfaatan_digital,
      pembukaan_1_select, inti_1_select, merefleksi_1_select,
      pembukaan_2_select, inti_2_select, merefleksi_2_select,
      pembukaan_3_select, inti_3_select, merefleksi_3_select,
      pembukaan_4_select, inti_4_select, merefleksi_4_select,
      pembukaan_5_select, inti_5_select, merefleksi_5_select,
      COALESCE(guru.nama, "Tidak ada pemiliknya") as pembuat_nama,
      semester.semester as nama_semester') // Select all columns from modul_ajar and the semester name
      ->where('modul_ajar.deleted', 0)
      ->where('modul_ajar.kelas_id', $this->session->get('kelas_id'))
      ->join('semester', 'semester.id = modul_ajar.semester') // Assuming the foreign key in modul_ajar is 'semester_id'
      ->join('guru', 'guru.id = modul_ajar.pembuat', 'left')
      ->join('desain_pembelajaran', 'desain_pembelajaran.modulajar_id_dp = modul_ajar.id', 'left') // Assuming the foreign key in modul_ajar is 'semester_id'
      ->join('data_select_dpl_kbc', 'data_select_dpl_kbc.modulajar_id_select = modul_ajar.id', 'left') // Assuming the foreign key in modul_ajar is 'semester_id'
      ->orderBy('modul_ajar.id', 'DESC')
      ->findAll();
---
SELECT `modul_ajar`.*, `desain_pembelajaran`.`modulajar_id_dp` as `modulajar_id_dp`, `pedagogik_model`, `pedagogik_strategi`, `pedagogik_metode`, `kemitraan`, `ruang_fisik`, `ruang_virtual`, `pemanfaatan_digital`, `pembukaan_1_select`, `inti_1_select`, `merefleksi_1_select`, `pembukaan_2_select`, `inti_2_select`, `merefleksi_2_select`, `pembukaan_3_select`, `inti_3_select`, `merefleksi_3_select`, `pembukaan_4_select`, `inti_4_select`, `merefleksi_4_select`, `pembukaan_5_select`, `inti_5_select`, `merefleksi_5_select`, COALESCE(guru.nama, "Tidak ada pemiliknya") as pembuat_nama, `semester`.`semester` as `nama_semester`
FROM `modul_ajar`
JOIN `semester` ON `semester`.`id` = `modul_ajar`.`semester`
LEFT JOIN `guru` ON `guru`.`id` = `modul_ajar`.`pembuat`
LEFT JOIN `desain_pembelajaran` ON `desain_pembelajaran`.`modulajar_id_dp` = `modul_ajar`.`id`
LEFT JOIN `data_select_dpl_kbc` ON `data_select_dpl_kbc`.`modulajar_id_select` = `modul_ajar`.`id`
WHERE `modul_ajar`.`deleted` = 0
AND `modul_ajar`.`kelas_id` = '10'

  public function ambil_data_dimensi()
  {
    $tahun = session()->get('tahun');

    $builder = \Config\Database::connect()->table('dimensi_profil_lulusan');
    $data = $builder->select('id, nama AS text')
      ->where('setting', $tahun)
      ->where('deleted', '0')
      ->get()
      ->getResult();
---
SELECT `id`, `nama` AS `text`
FROM `dimensi_profil_lulusan`
WHERE `setting` = '2025/2026'
AND `deleted` = '0'

  public function ambil_data_kurikulum()
  {
    $tahun = session()->get('tahun');

    $builder = \Config\Database::connect()->table('kurikulum_cinta');
    $data = $builder->select('id, nama AS text')
      ->where('setting', $tahun)
      ->where('deleted', '0')
      ->get()
      ->getResult();
---
SELECT `id`, `nama` AS `text`
FROM `kurikulum_cinta`
WHERE `setting` = '2025/2026'
AND `deleted` = '0'

  public function ambil_selected_texts()
  {
    $request = service('request');
    $ids = $request->getGet('ids');

    if (!is_array($ids)) {
      $ids = [$ids];
    }

    $tujuan = $this->tujuanPembelajaranModel->select('id, nama')
      ->whereIn('id', $ids)
      ->findAll();
---
SELECT `id`, `nama`
FROM `tujuan_pembelajaran`
WHERE `id` IN ('2','13','29','30','38','40')