app/Controllers/Santri.php

SELECT `santri_id`
FROM `ruang_kelas`
WHERE `kelas_id` = '11'
SELECT *
FROM `santri`
WHERE `id` IN ('38','23','22','21','24','42','26','62','53','56','40','57','59','33','34','63','51','60','64','58','31')
AND `deleted` = 0
---
  public function ambil_data_santri_by_kelas($kelasId)
  {
    // Ambil ID santri dari tabel ruang_kelas yang sesuai kelasId
    $santriIds = $this->ruangKelasModel
      ->select('santri_id')
      ->where('kelas_id', $kelasId)
      ->findAll();

    $ids = array_column($santriIds, 'santri_id');

    $data = [];
    if (!empty($ids)) {
      $data = $this->santriModel
        ->whereIn('id', $ids)
        ->where('deleted', 0)
        ->findAll();