app/Controllers/TujuanPembelajaran.php

  public function ambil_data_capaianpembelajaran()
  {
    $data = $this->capaianPembelajaranModel
      ->where('deleted', 0)
      ->where('setting', $this->session->get('tahun'))
      ->orderBy('urut', 'ASC') // Urutkan pertama berdasarkan kategori
      ->orderBy('nama', 'ASC') // Kemudian berdasarkan nama_capaian dalam setiap kategori
      ->findAll();
---
SELECT *
FROM `capaian_pembelajaran`
WHERE `deleted` = 0
AND `setting` = '2025/2026'
ORDER BY `urut` ASC, `nama` ASC