app/Models/LaporanBulananModel.php

  public function getLaporanByKelas($kelas_id, $tahun, $semester)
  {
    return $this->select('laporan_bulanan.*, guru.nama as pembuat_nama')
      ->join('guru', 'guru.id = laporan_bulanan.dibuat_oleh', 'left')
      ->where('kelas_id', $kelas_id)
      ->where('tahun', $tahun)
      ->where('semester', $semester)
      ->orderBy('bulan', 'ASC')
      ->findAll();
---
SELECT `laporan_bulanan`.*, `guru`.`nama` as `pembuat_nama`
FROM `laporan_bulanan`
LEFT JOIN `guru` ON `guru`.`id` = `laporan_bulanan`.`dibuat_oleh`
WHERE `kelas_id` = '10'
AND `tahun` = '2025/2026'
AND `semester` = 'GENAP'
ORDER BY `bulan` ASC