app/Models/RuangKelasModel.php

SELECT `kelas`.*, `santri`.*, `santri`.`nama` as `santri_nama`, `kelas`.`tingkat` as `kelas_tingkat`, `kelas`.`nama` as `kelas_nama`
FROM `ruang_kelas`
JOIN `santri` ON `ruang_kelas`.`santri_id` = `santri`.`id`
JOIN `kelas` ON `ruang_kelas`.`kelas_id` = `kelas`.`id`
WHERE `kelas`.`id` = '11'
---
  public function getSantriByKelas($kelas_id)
  {
    return $this->select('kelas.*, santri.*, santri.nama as santri_nama, kelas.tingkat as kelas_tingkat, kelas.nama as kelas_nama') // Pilih kolom yang Anda inginkan dari kedua tabel
      ->join('santri', 'ruang_kelas.santri_id = santri.id')
      ->join('kelas', 'ruang_kelas.kelas_id = kelas.id')
      ->where('kelas.id', $kelas_id)
      ->findAll();