app/Models/UserRoleModel.php

SELECT `uld`.`id`, `uld`.`nama`, `ull`.`type`
FROM `user_level_list` `ull`
JOIN `user_level_desc` `uld` ON `uld`.`id` = `ull`.`type`
WHERE `ull`.`user` = '1'
---
  public function getUserRoles($userId)
  {
    return $this->db->table('user_level_list ull')
      ->select('uld.id, uld.nama, ull.type')
      ->join('user_level_desc uld', 'uld.id = ull.type')
      ->where('ull.user', $userId)
      ->get()
      ->getResultArray();